{
  "filename": "10235211",
  "role": "BUSINESS-DEVELOPMENT",
  "sections": {
    "Experience": "Senior Associate Business Development \nJanuary 2015 to Current Company Name ï¼​ City , State\nWorking with private hard money lender as a negotiator for real estate contracts, and business development.\nWorking with brokers and clients to secure funding for real estate projects both commercial and residential, business acquisitions.\nBuild and maintain financial relationships with investors' brokers and funding partners.\nCEO \nJanuary 2011 to Current Company Name ï¼​ City , State\nRe-established brokering business after the real estate meltdown as an LLC in the state of Nevada.\nOwner operator in good standing with secretary of state.\nDuties to include but not limited to successfully negotiating large contracts valued in excess of 23 million dollars for clients with investors and\nor other funding sources.\nI display the following attributes vital to business to business protocol.\nResponding to investor and client leads timely, answering questions, providing information and ideally setting an appointment for meetings\nand three way calls.\nFollowing-up with leads to assist them as needed through their funding phase until ready for a financial decision and purchase.\nCEO \nJanuary 2001 to January 2005 Company Name ï¼​ City , State\nInfantry soldier, Iraq war veteran.\nOct, 2008 structured The Lane Organization, LLC under records of the Nevada Secretary of State as a Limited Liability Corporation.\nMain function was brokering real estate notes, annuities, and structured settlements.\nMain skill was to contact high profile investors to spark interests in client offerings using investor databases and points of contact.\nNegotiating fees and price offerings between investors, clients and other interested parties.\nField Radio Operator Communication specialist \nJanuary 1983 to January 1987 Company Name ï¼​ City , State",
    "Education": "Associate Degree : Sport Psychology , 2012 National University ï¼​ City , State , usa\nHigh School Diploma : 1983 Midfield high School ï¼​ City , State , usa\nAssociate of Arts : Golf Management , 08/2011 PGCC Professional Golfers Career College ï¼​ City , State , usa\nProfessional Golf Management City , State\n2011 to present Sport Psychology with audio sound therapy as a side study. Bachelors' degree in progress.\nProfessional Affiliations\nVeterans Administration\nPersonal Information\nFair play golfer, reading, learning and communicating. I have other interest outside of golf such as horses, traveling and other outdoor activities. Jet\nskiing, outdoor lunches with spouse, and too many things to want to do with little or no time to do them. Outgoing energetic and fun to be around.\nIn a business setting I am the type to roll up the sleeves and grab the task at hand. Due to my military background I am able to make quick\ndecisive decisions and work under stress. I am currently looking for the next career move in life and will embrace it energetically for the right\nemployer. I am trainable and still strive to learn at least one thing every day.\nInterests\nShadow Valley Golf Course: Boise, Idaho - Caddie Services 2009-2010 Ontario Golf Course: Ontario, Oregon - Volunteer course maintenance\n2009-2011 Soboba Classic Nation Wide Tour: Volunteer 2009-2010 LPGA Pro Am Kraft Nabisco, Mission Hills Country Club, Pro Am\nCaddie 2011 Professional Golfers Career College Associates Degree in golf Instruction 2009-2011",
    "Skills": "acquisitions, audio, Bachelors, business development, contracts, client, clients, databases, financial, notes, meetings, money, Negotiating,\nnegotiator, Oct, progress, Psychology, real estate, settlements, sound, structured\nAdditional Information\nMEDALS U.S. Army Good Conduct Medal U.S. Marine Corp Good Conduct Medal National Defense Service Medal U.S. Army Good\nConduct Medal U.S. Marine Corp Good Conduct Medal National Defense Service Medal GOLF EXPERIENCE: Shadow Valley Golf\nCourse: Boise, Idaho - Caddie Services 2009-2010 Ontario Golf Course: Ontario, Oregon - Volunteer course maintenance 2009-2011\nSoboba Classic Nation Wide Tour: Volunteer 2009-2010 LPGA Pro Am Kraft Nabisco, Mission Hills Country Club, Pro Am Caddie\n2011 Professional Golfers Career College Associates Degree in golf Instruction 2009-2011\nAbout me: Fair play golfer, reading, learning and communicating. I have other interest outside of golf such as horses, traveling and other\noutdoor activities. Jet skiing, outdoor lunches with spouse, and too many things to want to do with little or no time to do them. Outgoing\nenergetic and fun to be around. In a business setting I am the type to roll up the sleeves and grab the task at hand. Due to my military\nbackground I am able to make quick decisive decisions and work under stress. I am currently looking for the next career move in life and\nwill embrace it energetically for the right employer. I am trainable and still strive to learn at least one thing every day."
  },
  "text_length": 8190,
  "processed_at": "2025-05-28T14:58:13.521315"
}