{
  "filename": "10641230",
  "role": "INFORMATION-TECHNOLOGY",
  "sections": {
    "Accomplishments": "Rebuilt a client's website from the ground up and increased monthly hits from 3422 to 40884 in a matter of a few months.\nDesigned, priced, built, and installed a complete information system upgrade for a client; including networking devices, wiring, client\ncomputers, server and software.\nDiagrammed, prototyped, and assembled a portable USB phone charger outputting optimal voltage and amperage, with circuits and\ncomponents small enough to all fit in an Altoids tin.\nIt allows next to unlimited portable phone charging due to the device itself being recharged by a small solar panel on the top.\nAutomated and streamlined daily office tasks for client using Batch Scripting.\nTroubleshot medical technology including X-ray machines and medical industry client and server software (Eaglesoft).\nInformation Technology project management experience.\nProgrammed a cloud storage website allowing a client access to a shared home network drive from any browser, anywhere.\nIt includes security login, uploading and downloading.\nWork Experience\nIT management \nMarch 2012 to November 2012 Company Name ï¼​ City , State\nIn charge of planning, budgeting, and executing all IT projects.In addition to office troubleshooting, building/managing the company website\nand designing/updating the business's electronic newsletter.\nInformation Technology Consultant \nJuly 2011 to February 2012 Company Name ï¼​ State\nContracted IT consulting work from client computer repair to network expansion.\nMay 2011 to July 2011 Company Name ï¼​ City , State\nIn charge of company website management, social media administration, as well as assisting in administrative tasks.\nEducation and Training\nAssociate of Science : Information Technology , 2014 Lyons Township ï¼​ City , State , United States Information Technology\nHigh School Diploma General Education\nCoursework in computer science all 4 years GPA: Diamond Achievement Academic award * Honor Roll Diamond Achievement Academic\naward * Honor Roll",
    "Skills": "A+ certified, ActionScript, Active directory, administrative, Adobe Creative Suite 5, Photo, Audio, Brochure, budgeting, business management,\nclient and server, CMS, Hardware, computer repair, consulting, Content Management, CSS, CSS3, client, Database, designing, Documentation,\nElectronics, XML, Graphics, Hardware support, HTML, HTML5, PHP, Information security, Java, Java programming, JavaScript, Linux, Logic,\nLogo, Mac OS, managing, marketing, Medical technology, Microsoft Office, office, Windows, Windows 95, Network engineering, network,\nNetworking, newsletter, Operating Systems, Organization development, Programming, protocols, Prototyping, Search Engine Optimization,\nservers, Storyboarding, TCP/IP, Telephony, Phone 7.0, Troubleshooting, upgrade, video, video editing, Web Development I, Website, website\nmanagement, Windows Server, Wiring"
  },
  "text_length": 5222,
  "processed_at": "2025-06-15T15:11:34.808729"
}