{
  "filename": "12472574",
  "role": "ENGINEERING",
  "sections": {
    "Skills": "Quality Assurance, Testing, Access, Qa, Cases, Database, Regression Testing, Visual Basic, Client/server, Clients, Integration, Integration\nTesting, Integrator, Lotus Notes, Microsoft Windows, Ms Access, Ms Visual Basic, Printing, Software Quality Assurance, Windows 95,\nElectrical Engineering, Documentation, Network Protocols, Oracle, Proposals, Sql, Unix, Qa Test, Test Plan, Test Cases, Application Analysis,\nApplication Support, Automated Test Scripts, Basis, Billing, Business Process Management, C++, Contracts, Dispatching, Issues Management,\nLogistics, Maintenance, Maintenance Repair, Planning Modules, Process Management, Qa Testing, Scheduling, Staff Training, Strategic Planning,\nSystems Support, Telephony, Test Scripts, Training, Graphical User Interface, Gui, Wireless, Black Box, Usability, Adt, Api, Application\nDevelopment, Pocket Pc, System Administration, Systems Administration, Telephones, Voice, Wap, Retail, Retail Marketing, Team Lead,\nArchitecture, Database Systems, Design Review, Engineer, Quality Engineer, Software Quality Engineer, Test Plans, White Box, White Box\nTesting, Black Box Testing, Data Acquisition, Databases, Db2, Dbase, Dbase Iv, Excellent Verbal And Written Communication Skills, Ftp, Ieee,\nInternet Explorer, Ipx, Java, Javascript, Linux, Ms Office, Netbeui, Netscape, Networking, New Products, Novell, Operations, Problem Solving,\nRdbms, San, Software Development, Software Testing, Solutions, Storage Area Network, Structured Software, System Integration, Tcp, Tcp/ip,\nVirtual Machine, Visual Test, Vm, Assurance Analyst, Automated Testing, Back End, Data Integrity, Dos, Encryption, Exchange, File, Invoice,\nLan, Ms Exchange, Ms-dos, Progress, Security, Business Intelligence, Collection, Data Collection, Data Mining, Data Warehousing, E-business,\nEmbedded Systems, Html, Inspections, Inventory, Qa Engineering, Real Time, Real Time Embedded, Real Time Embedded Systems, Shipping,\nWireless Data",
    "Certifications": "National Education Center\nProfessional Affiliations\nElectronic Invoice Presentment is a new enhancement to Visa e-Pay Service and provides Member Financial Institutions the ability to offer Billers\nand Retail Customers electronic invoice delivery capability. EIP system is based on Windows NT 4.0 platform and is developed using Visual Basic\nand Access database as the back end. System performs data transport via the following communication channels: MS Exchange, Virtual Area\nNetwork (VAN) LAN, CompuServe and Sprint-Net Responsible for developing of low-level QA Test Plan and QA Reference Documentation\nand QA Findings Document for the Pilot project. Assist in development of new testing methods and procedures, and improving testing efficiencies.\nRecommended methods for automating testing using QA Partners a tool Perform Acceptance, functional, GUI usability, and error handling stress\nand regression testing using black box and gray box testing techniques. Validate that data integrity and security is presented on all levels of data\ntransport: verify transmission completeness against the database, compare input with output using MS-DOS batch file, check files format against\n\nthe known set of templates, test data encryption and password protection Interviewed new applicants for QA Analyst positions for the project;\nTrained new members of the team for the their first days; Assigned responsibilities to the team members and wrote daily status reports, which\nincluded summery of the activities performed during each shift, to the Project Lead. Presented QA Group on the Department meetings as a QA\nTeam Lead and conference calls every 4 hours, which included report of the progress in the testing cycle. Made sure that needed support was\nprovided to the QA Team from the Developing Team. Performed manual and automated testing of the application. Entered open/found Drs/bugs\ninto TRACKER bug tracking database and verified that Drs/bugs was close/fixed. Wrote and executed test cases for acceptance, boundary,\nperformance, regression, volume and stress testing. Developed and performed automated test cases using QA Partner 4.0 in Windows NT\nenvironment. Wrote \"The Findings Document\" - a summary document of QA Team analyses, findings, suggestions and/or concerns found during\nthe testing cycle on the project"
  },
  "text_length": 17711,
  "processed_at": "2025-06-15T15:11:34.224938"
}