{
  "filename": "15118506",
  "role": "INFORMATION-TECHNOLOGY",
  "sections": {
    "Certifications": "VMware Certified Professional 5 - Data Center Virtualization\nVMware Certified Professional 5 - Desktop Virtualization\nITIL Foundation Certified\nMicrosoft Certified Professional - Server 2012\nCore Accomplishments\nLeadership Skills:\nLed committee to successfully changeÂ our organization's dealership management system (DMS).Â  The DMS is similar to an ERP system\nfor auto dealerships\nCharged with maintaining compliance and security for customer data. Successfully manage data sharing relationships with more than ten third\nparty vendors. Worked closely with DMS provider to develop an acceptable secure data sharing platform.\n\nProject Management:\nCurrently managing the conversion of the dealership to a newÂ dealership management system.Â  Created and ran sub-committees,\nmapped out and executed the conversion plan, responsible for many key process changes and workflowsÂ \nServed as project manager for project creating a paperless work flow and digital storage process which resulted in 50% reduction of\nadministrative processing time, $30,000/year reduction in costs, while increasing document availability and storage accuracy.\nAs project manager, developed Smart Motors domain environment including group policy, DNS, multiple domain controllers, and OU\nstructure.\nManaged email conversion project, deploying Smart Motors' on-site Exchange server. Converted existing email accounts from non-\nExchange and provide access via Outlook Web App and mobile phone connectionsÂ \nServed as project manager on several projects developing Smart Motors' virtual environment, including 5 esxi hosts separated into two\nresource pools, vCenter, Horizon View for 120 users utilizing 2 view connection servers and a security server\nInstalled and mange TrendMicro agentless security for VMware View\nStaff Development:\nFrequently met one on one with staff to determine motivation and goals. Guided staff in creation of goals and the pursuit there of\nPresented daily topics in morning meetings to inform and reinforce company core values such as commitment to quality, customer\nsatisfaction, and continuous improvment\nDeveloped and implemented a training program for new employees, providing them with the technology skills necessary for efficient and\nsuccessful use of company technology tools\nOperations Management:\nManaged the infrastructure to support 260 users selling 500 vehicles and servicing 7,000Â vehicles each month\nHandled all technology vendor interactions including contract negotiations, SLA monitoring, and license utilization",
    "Education": "Bachelor of Science : Management Information Systems Cardinal Stritch University City , State\nOnline Profile\nLinkedIn\nwww.linkedin.com/in/RobertRJordan Â"
  },
  "text_length": 5254,
  "processed_at": "2025-05-28T14:58:15.912037"
}