{
  "filename": "15145575",
  "role": "BPO",
  "sections": {
    "Education": "B.A EIILM University ï¼​ City\nHigher Secondary passed From M.P. Board Bhopal. High School passed From M.P. Board Bhopal. Professional Certifications MCP Microsoft\nCertified Professional fist paper clear of administering Windows Server 2012 in June 2013. (ID No. 10171726) CCNA - Cisco Certified\nNetwork Associates in Dec. 2009. (ID No. 11716258) JCHNP- Jetking Certified Hardware Networking Professional from jetking infotrain\nlimited ,A.B. Road Indore\nM.P : 2010\nProfessional Affiliations\nNational Council For Vocational Training from Neocorp International Ltd Pithampur in Nov - 2013. Major Attainments Accredited with Best\nCricketer Award from Neocorp Internation LTD Inter Tournament in Indore (2014). Personal Vitae Father's name : Mr. Govind Singh Lodhi\nDate of birth : 1st Jan 1988.\nPersonal Information\n\nMarital status : Married. Hobbies : Playing Cricket Permanent Address : Village:- Jhinna , Post:- Abhana , Disit:- Damoh , (M.P.) Pin Code :-\n470662 Declaration I here by declare that whatever information I have given above is correct according to the best of my knowledge.",
    "Languages": "English, Hindi.",
    "Skills": "Active Directory, Backup, CCNA, CISCO, Cisco Certified, Computer Hardware, Hardware, Client, customer satisfaction, Dec, DHCP, DNS,\nEIGRP, English, ERP, Firewalls, FTP, GUI, Hindi, IP, LAN, Managing, access, Microsoft Certified Professional, MCP, mail, Microsoft office,\nOffice, outlook, Windows 8, Windows, Windows7, Windows XP, migration, ESS, Network Associates, Network Printers, network and\ntroubleshooting, network, Networking, OSPF, policies, printer, Protocols, RIP, Routers, Routing, SAP, SAP Basis, Servers, Switches, technical\nsupport, Phones, TELNET, Terminal Server, Troubleshooting, Vista, WAN, Windows Server\nAdditional Information\nMarital status : Married. Hobbies : Playing Cricket Permanent Address : Village:- Jhinna , Post:- Abhana , Disit:- Damoh , (M.P.) Pin Code\n:- 470662 Declaration I here by declare that whatever information I have given above is correct according to the best of my knowledge."
  },
  "text_length": 6067,
  "processed_at": "2025-06-15T15:11:33.353280"
}