{
  "filename": "16270906",
  "role": "TEACHER",
  "sections": {
    "Accomplishments": "Developed knowledge in both areas of Accounts Receivable and Accounts Payable.\nSaved the department money despite the short-handed status in staff and budget fall for over a year with assisting in both Accounts\nReceivable and Accounts Payable.",
    "Experience": "TEACHER \nMarch 2013 to Current Company Name\nSenior Accountant\nResponsible for auditing the third party vendor's health insurance billing generated for participating school districts within the entire state of\nTexas.\nMonitor school districts in delinquent status and recommend warrants to withhold state funds administered by the Texas Education Agency\nwith an effort to collect outstanding dues.\nPrepare a monthly analysis to detect any underlying billing issues provided by our third party vendor and recommend solutions to repair and\nprevent future billing issues.\nCompile a monthly Accounts Receivable reconciliation report to ensure revenue and expense transactions have been accurately recorded\nbefore presenting it to senior management.\nProvide assistance to school district's officials in relation to State Regulations, Health Coverage Plans, and Texas Legislative decisions.\nResolve and make a determination for retroactive credit requests received from school districts that involve complex research and billing\naudits.\nReview and approve third party vendor invoices for contract compliance accuracy.\nReconcile budget reports to reflect internal accounting expenses ensuring that fund distributions were accurately recorded.\nAdjust monthly annuity disbursements belonging to TRS Retirees that have erroneously underpaid for their Health Insurance premium.\nApprove check refund distributions to TRS Retirees that have made overpayments on their Health Insurance premium.\nResearch and compile annual ad-hoc reports that include the Affordable Care Act fee versus our Health Insurance costs to decide on future\npremium rates.\nCompile current year accounting data to generate the Comprehensive Annual Financial Report (CAFR).\nKnowledge of state laws related to health care and insurance programs, retiree health care benefits, and financial and accounting regulations.",
    "Education": "Bachelors of Arts : Business Administration CONCORDIA UNIVERSITY ï¼​ City , State , US CONCORDIA UNIVERSITY, AUSTIN,\nTEXAS Bachelors of Arts in Business Administration, January 2012 to December 2014\nAssociates of Arts : Business Administration AMERICAN INTERCONTINENTAL UNIVERSITY ï¼​ City , State , US AMERICAN\nINTERCONTINENTAL UNIVERSITY, ILLINOIS Associates of Arts in Business Administration, November 2010 to December 2011\nEAGLE PASS HIGH SCHOOL, EAGLE PASS, TEXAS\nHigh School Diploma High School Diploma, May 1998\nProfessional Affiliations\nMAXIMUS, TEXAS ACCESS ALLIANCE to",
    "Skills": "Accounting, Credit, Invoices, Budget, Accounts Payable, Cash, Of Accounts, Accountant, Audits, Billing, Buying/procurement, Customer\nService, General Accounting, Operations, Payments, Purchasing, Receptionist, Retail Sales, Accounts Receivable, Basis, Data Entry, Assistant\nDirector, Associate, Aviation, Budgeting, Career Development, Contracts, Credit Card, Excellent Customer Service Skills, Executive Assistant,\nFixed Assets, Maintenance, Pipeline, Purchase Orders, Reconciling, Supply Chain, The Accounts, Clerk, Estimation, Finance, With Accounts,\nAnd Accounting, Audit, Auditing, Benefits, Collection, Financial Report, Healthcare, Increase, Insurance Billing, Reconciliation, Solutions,\nDatabase, Administrative Assistant, Disbursement, Filings, Great Customer Service Skills, Legal Documents, Team Player, Medicaid, Quota"
  },
  "text_length": 10895,
  "processed_at": "2025-05-28T14:58:16.472347"
}