{
  "filename": "54246169",
  "role": "AGRICULTURE",
  "sections": {
    "Experience": "Jan 2016 to Jan 2016 \nwork as Language officer with IPCB-S , international police coordination board Kabul Afghanistan.\nResponsibilities: Performing translations from English to Pashto/Dari of various documents (Presentations, letter, reports, minutes, etc).\nSimultaneous translations in IPCB-S meetings.\nUndertaking any other tasks required by the Head of IPCB-S.\nAgriculture Advisor and Language Officer Jan 2016 to Jan 2016 \nLaghman PRT/ADT.\nResponsibilities: Establish and maintain strong coordination and good communication channels with governmental as well as non-\ngovernment organizations, working for growth of the private sector of Afghanistan.\nWorked strategic planning with DAIL Office.\nAssist DAIL (Department of irrigation, Agriculture, and livestock) staff for annual planning.\nAttend and represent PRT/ADT in relevant meetings and workshops out of the organization at provincial level.\nPreparing Module need assessment based.\nArrangement of Training plan and Materials for Nangarhar university Agriculture students.\nAssist and guide DAIL research department in needs assessments.\nAssist the DAIL research department in assessing the needs of staff for short, medium and long term trainings.\nCooperate closely with DIAL (Department of irrigation, Agriculture, and livestock) office staff in technical and managerial affairs.\nTrain Nangarhar university Agriculture faculty students, practically in the field.\nTrain women affair department staff and poor family regarding home gardening and kitchen gardening.\nTranslate Agriculture guidelines and project technical formats in to local languages as required.\nPrepared training materials to DAIL staff and farmers.\nProvincial Manager Jan 2013 to Jan 2016 \nwork as with BRAC Education Program for Afghanistan Responsibilities: Prepare and implement plan for concerned areas and implement\nthe concerned project activities according to the approved annual work plan.\nSupervise the staff and schooling activities in the concerned areas according to the plan.\nTake special steps for the development of the female staff.\nBuild positive and competitive mindset of the staff.\nOverall responsible for preparing and submitting all kinds of reports to central office and communicate coordinate with related provincial\nlevel offices.\nTake necessary steps for enhancing the capacity of the staff in order to administer the all project activities effectively.\nplant protection Manager Jan 2002 to Jan 2004 \nCompany Name\nProvided improved seed to farmers.\nWorked with farmers on the field to control plant disease.\nGave refresh courses about plant disease to farmers.\nRecord all plant diseases reports, from all districts.\nManaged all state Agriculture properties, for cultivation.",
    "Education": "B.Sc. (Hons) degree , Agriculture 2002 Nangarhar University Agriculture\n1997 Baccalaureate from Nangarhar High School Afghanistan",
    "Accomplishments": "Driving of small vehicles Courses: Attended training on Agriculture New technology, U.S.A Kansas state.\nStudied up to Advance two in Oxford English language center, Jalalabad Teacher training program in Oxford English language center,\nJalalabad Conversation class in Oxford English language center, Jalalabad Travels and visits: To Kansas state America, as member of an\nofficial delegation to participate in a workshop on improvement of Agriculture and delivered a presentation of Afghanistan Agriculture, on\nOctober 2010.\nI have received Recommendations, and appreciation letters from different government and non-governments organizations for the good\nperformance.\nPersonal Information\nI submit my C.V for your kind Consideration and hope to hear from you for an interview. Best regards,",
    "Languages": "Fluency in Pashto, Dari, English, and ordo",
    "Skills": "competitive, English, government, irrigation, managerial, Materials, meetings, Excel, Office, power point, Word, police, Presentations, research,\nstrategic planning, training materials, translations, typing, workshops\nAdditional Information\nI submit my C.V for your kind Consideration and hope to hear from you for an interview. Best regards,\nFayaz Ahmad Sardar Personal information: Married status: Married U.S.A Green Card Holder"
  },
  "text_length": 6703,
  "processed_at": "2025-05-28T14:58:12.227886"
}