{
  "filename": "65325317",
  "role": "ARTS",
  "sections": {
    "Education": "2002\nU.S. Coast Guard Certification\nAntiterrorism Force Protection Level II Certification\nExcelsior College BS-Liberal Arts BS : Management and Psychology Excelsior College BS-Liberal Arts (Administration/Management and\nPsychology Focus) Military Education Command Security Officer Course Export Domestic Maritime Training Law Enforcement Boarding Officer\nCourse ICS-300, 200, 100 Applied Suicide Intervention Course\nMilitary Experience\n05/1985 - 09/2009\nCompany Name Chief Warrant Officer Four\nUNITED STATES COAST GUARD May 1985 to September 2009 Chief Warrant Officer Four (BOSN) Operations Officer of 7th Crew,\nUSCG PATFORSWA (Patrol Forces Southwest Asia) detailed with directing Forward Operating Base personnel in Kuwait during Operation\nIraqi Freedom for CTF 55.6 and CTF 150 assets (2005 - 2006). Deck Watch officer for multiple Patrol Boats in support of Operation Iraqi\nFreedom (2005 - 2006). Liaison Officer for CTF 55.6 to Oman, Yemen, UAE, Kuwait, and Djibouti detailed with planning, and executing\ntraining events for at sea enforcement; planned and directed Personal Protective Services for US and foreign senior officials INCONUS (2002 -\n2005) and while attached to CTF 55.6 (Operation Iraqi Freedom 2005 - 2006). Directed emergency management efforts for military base, which\nincluded civilian populace (2002 - 2005). Law Enforcement Officer for drug interdiction, alien migration interdiction, maritime law enforcement,\ndomestic and international fisheries enforcement, counterterrorism and antiterrorism (1985 - 2009). Security Officer/Chief of Police for Coast\nGuards largest base (2002 - 2005): Initiated background investigations for base personnel; provided follow up and reporting of derogatory\ninformation to the Coast Guard Intelligence Center; Led full police force assigned to provide security, safety, and enforce federal and state laws;\nLiaison with local, and federal law enforcement agencies; led and/or oversaw investigations for criminal and civil cases. Administration/Leadership\nManaged administrative offices as Executive Petty Officer (1989 -1990), Command Enlisted Advisor (1997-1999), Officer In Charge of Forward\nOperating Base Kuwait (2005 - 2006). Managed daily routine for all aspects of administrative support to personnel assigned to my units.\nAdministrative matters included but not limited to, travel coordination, performance reviews, daily event and job schedule management, training\nadministration, work site coordination with other units/groups, and other duties as assigned by higher authority. Developed and implemented\ntracking system for qualifications/certifications for operational units of all positions in the unit to meet mission requirements (1999 - 2002, 2006 -\n2007, 2007 - 2009). Trained personnel of various units on human resource requirements such as sexual harassment, diversity, workplace\nenvironment, and work life issues (1994 - 1999, 2002 - 2006, 2007 - 2009). Administered preventive maintenance program for shipboard, small\ncraft (21 to 55 foot), and ATV systems including cranes, winches, pulley systems, fire control systems, minor machinery (compressors, generators,\netc.) (1986 - 1999, 2002 - 2009). Contracting Officer Technical Representative (COTR) (1989-1990, 1993-1994, 1995-1996, 1999-2002,\n2007-2008) for various projects throughout my military career which included large Cutter renovations, small vessel acceptance, and small vessel\nrenovations/alterations. COTR for various contractors and subcontractors for recurring shipboard maintenance programs (flight deck renewal,\ninterior renovations, systems renovations/repairs, etc.). Worked with Area Command staff to develop contract RFP's for various shipboard\nprojects including flight deck renewal, interior renovations, systems renovations/repairs, small craft purchases, and large maintenance equipment\npurchases. Communications Strong communications, public speaking, and senior-level presentation experience (Instructor 1977 - 1979, senior\ninstructor 1996 - 1999, Security Officer 2002 - 2005, Liaison Officer 2005 -2006). Extensive senior-level presentations to foreign military and\nofficials (1996 - 1999, 2002 - 2005, 2005 -2007).",
    "Certifications": "Antiterrorism Force Protection Level II Certification\nProfessional Affiliations\nKodiak High School Booster Club\nPresentations\nStrong communications, public speaking, and senior-level presentation experience (Instructor 1977 - 1979, senior instructor 1996 - 1999,\nSecurity Officer 2002 - 2005, Liaison Officer 2005 -2006). Extensive senior-level presentations to foreign military and officials (1996 - 1999,\n2002 - 2005, 2005 -2007)",
    "Skills": "Liaison, Security, Training, Budget, Collections, Credit, Increase, Marketing, Video Teleconferencing, Cases, Instructor, Administrative Support,\nCompressors, Control Systems, Fire Control, Generators, Industrial Machinery, Interior Renovations, Maintenance, Preventive Maintenance,\nOperations, Budget Management, Logistics, Logistics Management"
  },
  "text_length": 11150,
  "processed_at": "2025-05-28T14:58:12.642579"
}